 <?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// [ 应用入口文件 ]

// 定义应用目录
define('APP_PATH', __DIR__ . '/../application/');
//  自定义日志记录目录
define('LOG_PATH',__DIR__.'/../log/');
// 加载框架引导文件
require __DIR__ . '/../thinkphp/start.php';

 // 重写错误日志记录方法
\think\Log::init([
    'type' => 'File',    //  重写错误日志记录的方法
    'path' => LOG_PATH.'sql_Log/',//  重写错误日志记录的记录位置
    'level' => ['sql']  //  重写错误日志记录的级别
]);